Revit 2027 API
FabricationPart.GetDimensionDefinitions Method
 Gets a copy of current fabrication dimension definitions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationDimensionDefinition> GetDimensionDefinitions()
Public Function GetDimensionDefinitions As IList(Of FabricationDimensionDefinition)
public:
IList<FabricationDimensionDefinition^>^ GetDimensionDefinitions()
member GetDimensionDefinitions : unit -> IList<FabricationDimensionDefinition>
Return Value
IList<FabricationDimensionDefinition>
 Returns an array of fabrication dimension definitions.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace